### Top 40 Python Pandas Technical Interview Questions

In [ ]:
import pandas as pd
import numpy as np
from datetime import timedelta

### Sample DataFrame for the 40 Interview Questions

A sample DataFrame for the 40 interview questions

In [23]:
NUM_ROWS = 100_000
np.random.seed(42)

data = {}

start_date = pd.to_datetime('2023-01-01')
data['Transaction_Date'] = [start_date + pd.Timedelta(days=i % 365, hours=np.random.randint(0, 24)) for i in range(NUM_ROWS)]

categories = np.random.choice(['East', 'West', 'North', 'South'], size=NUM_ROWS, p=[0.4, 0.3, 0.2, 0.1])
data['Region'] = pd.Series(categories, dtype='category')

def generate_product_code():
    types = ['PKG', 'SGL', 'BNDL']
    numbers = np.random.randint(100, 999)
    return f"{np.random.choice(types)}-{numbers}"

data['Product_ID_Name'] = [generate_product_code() + ' ' + np.random.choice(['Laptop', 'Mouse', 'Keyboard', 'Monitor']) for _ in range(NUM_ROWS)]

data['Revenue'] = np.random.normal(loc=500, scale=150, size=NUM_ROWS)
data['Revenue'][np.random.choice(NUM_ROWS, size=10000, replace=False)] = np.nan
data['Revenue'] = data['Revenue'].round(2)

data['Transaction_ID'] = np.arange(100000, 100000 + NUM_ROWS)
data['Customer_ID'] = np.random.randint(100, 500, size=NUM_ROWS)
data['Cost'] = (data['Revenue'] * np.random.uniform(0.5, 0.8, size=NUM_ROWS)).round(2)
data['Units_Sold'] = np.random.randint(1, 100, size=NUM_ROWS)
data['Is_Discounted'] = np.random.choice([True, False], size=NUM_ROWS, p=[0.25, 0.75])
data['Rating'] = np.random.randint(1, 6, size=NUM_ROWS)

df = pd.DataFrame(data)
df.head()

,Transaction_Date,Region,Product_ID_Name,Revenue,Transaction_ID,Customer_ID,Cost,Units_Sold,Is_Discounted,Rating
0,2023-01-01 06:00:00,West,BNDL-125 Laptop,424.37,100000,225,299.01,28,False,5
1,2023-01-02 19:00:00,East,PKG-836 Mouse,573.06,100001,486,430.45,58,False,1
2,2023-01-03 14:00:00,East,PKG-100 Keyboard,621.18,100002,309,362.17,25,False,1
3,2023-01-04 10:00:00,West,PKG-690 Mouse,565.52,100003,237,383.75,6,False,4
4,2023-01-05 07:00:00,West,SGL-480 Keyboard,335.35,100004,422,191.71,86,False,4

1. How would you create new columns derived from existing columns in Pandas?

In [ ]:
# Create a new column by specifying the name of it within the DataFrame
# Reference the other columns via. [] enclosed with their name in single or double quotes

df["Total"] = df["Cost"] * df["Units_Sold"]
df["Total"] = df["Total"].round(2)

df.head()

,Transaction_Date,Region,Product_ID_Name,Revenue,Transaction_ID,Customer_ID,Cost,Units_Sold,Is_Discounted,Rating,Total
0,2023-01-01 06:00:00,West,BNDL-125 Laptop,424.371703,100000,225,299.013149,28,False,5,8372.37
1,2023-01-02 19:00:00,East,PKG-836 Mouse,573.063671,100001,486,430.457406,58,False,1,24966.53
2,2023-01-03 14:00:00,East,PKG-100 Keyboard,621.176000,100002,309,362.167215,25,False,1,9054.18
3,2023-01-04 10:00:00,West,PKG-690 Mouse,565.515664,100003,237,383.744410,6,False,4,2302.47
4,2023-01-05 07:00:00,West,SGL-480 Keyboard,335.353736,100004,422,191.715417,86,False,4,16487.53

2. A column in a `df` has type `True`/`False` values, but for further calculations, we need 1/0 representation. How would you transform it?

In [ ]:
# 1. Use apply function of the database to create a sub-function via. 
# lambda that will convert the result to 1 if True or False otherwise

df['Is_Discounted'] = df.apply(lambda x: 1 if x is True else 0, axis = 1)
df.head()

,Transaction_Date,Region,Product_ID_Name,Revenue,Transaction_ID,Customer_ID,Cost,Units_Sold,Is_Discounted,Rating
0,2023-01-01 06:00:00,West,BNDL-125 Laptop,424.37,100000,225,299.01,28,0,5
1,2023-01-02 19:00:00,East,PKG-836 Mouse,573.06,100001,486,430.45,58,0,1
2,2023-01-03 14:00:00,East,PKG-100 Keyboard,621.18,100002,309,362.17,25,0,1
3,2023-01-04 10:00:00,West,PKG-690 Mouse,565.52,100003,237,383.75,6,0,4
4,2023-01-05 07:00:00,West,SGL-480 Keyboard,335.35,100004,422,191.71,86,0,4

In [ ]:
# 2. Convert the column from a bool to an int

df['Is_Discounted'] = df['Is_Discounted'].astype(int)
df.head()

,Transaction_Date,Region,Product_ID_Name,Revenue,Transaction_ID,Customer_ID,Cost,Units_Sold,Is_Discounted,Rating
0,2023-01-01 06:00:00,West,BNDL-125 Laptop,424.37,100000,225,299.01,28,0,5
1,2023-01-02 19:00:00,East,PKG-836 Mouse,573.06,100001,486,430.45,58,0,1
2,2023-01-03 14:00:00,East,PKG-100 Keyboard,621.18,100002,309,362.17,25,0,1
3,2023-01-04 10:00:00,West,PKG-690 Mouse,565.52,100003,237,383.75,6,0,4
4,2023-01-05 07:00:00,West,SGL-480 Keyboard,335.35,100004,422,191.71,86,0,4

3. Describe how you will get the names of columns of a DataFrame in Pandas

In [38]:
# 3. Iterate through the columns of a DataFrame and print each one

for col in df.columns:
    print(col)
    
# Additionally, make a list of each column/Series with a DataFrame
print(f"\n{list(df.columns)}")
# Return the values of each column and aggregate into a List
print(f"\n{list(df.columns.values)}")
# The sorted() function will return a list of the columns in alphabetical order
print(f"\n{sorted(data)}")

Transaction_Date
Region
Product_ID_Name
Revenue
Transaction_ID
Customer_ID
Cost
Units_Sold
Is_Discounted
Rating

['Transaction_Date', 'Region', 'Product_ID_Name', 'Revenue', 'Transaction_ID', 'Customer_ID', 'Cost', 'Units_Sold', 'Is_Discounted', 'Rating']

['Transaction_Date', 'Region', 'Product_ID_Name', 'Revenue', 'Transaction_ID', 'Customer_ID', 'Cost', 'Units_Sold', 'Is_Discounted', 'Rating']

['Cost', 'Customer_ID', 'Is_Discounted', 'Product_ID_Name', 'Rating', 'Region', 'Revenue', 'Transaction_Date', 'Transaction_ID', 'Units_Sold']

4. What is the difference betwen .loc and .iloc

In [ ]:
# 4. .iloc must pass in the only the index of the row
# while .loc can pass in column labels and additional things as well